// ДЗ 3. Змінні та керуючі конструкції


// 1. Вам необхідно написати програму, яка приймає на вхід число і виводить у консоль повідомлення залежно від значення числа. Якщо число ділиться на 3, то повідомлення має бути Fizz, якщо число ділиться на 5, то повідомлення має бути Buzz, а якщо число ділиться і на 3, і на 5, то повідомлення має бути FizzBuzz. Наприклад, для числа 15 повідомлення має бути FizzBuzz.

// let age = prompt('Lets divine 3 or 5');

// if (age % 3 === 0 && age % 5 === 0) {
//     alert('BuzzFizz')
// }
// else if (age % 3 === 0) {
//     alert('Buzz')
// } else if (age % 5 === 0) {
//     alert('Fizz')
// } 
// else {
//     alert('This number cannot be divided by 3 or 5')
// }


// 2. Вам необхідно написати програму, яка приймає на вхід число і виводить у консоль повідомлення, що вказує, чи є введений рік високосним.

// let year = prompt('Lets check a year:');
// let yearLeap = false;

// if (year % 4 === 0) {
//     yearLeap = true;
// } 
// if (yearLeap=== true && year % 100 === 0) {
//     yearLeap = true;
// } 
// if (yearLeap === true && year % 400 === 0) {
//     alert('The ' + year + ' is leap year')
// } else {
//     alert('The ' + year + ' is not leap year')
// }


// 3. Вам необхідно написати програму, яка приймає на вхід число і виводить у консоль повідомлення у форматі Вам N рік / ріки / років. Залежно від числа N слово рік має змінюватися на років або року. Наприклад, Вам 1 рік, Вам 5 років, Вам 42 роки.

let age = prompt("Введіть ваш вік:");

if (age % 10 === 1 && age % 100 !== 11) {
    alert('Вам ' + age + ' рік')
} else if (age % 10 >= 2 && age % 10 <= 4 && (age % 100 < 10 || age % 100 >= 20)) {
    alert('Вам ' + age + ' роки')
} else { 
    alert('Вам ' + age + ' років')
}  